Table of Contents
 Enum ImperfectionDirection
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
direction of imperfection
public enum ImperfectionDirection
Fields
BiggerSlenderner = 1
bigger slenderness direction
Both = 3
both
BothDirections = 0
Imperfections are separately added to both directions, y and z.
FromSetup = 4
Takes imperfection direction from global code setup. This value must not be used in code setup!
MomentResultant = 2
resultant of moments
Fields
 Name |  Description
 BiggerSlenderner = 1
bigger slenderness direction
 Both = 3
both
 BothDirections = 0
Imperfections are separately added to both directions, y and z.
 FromSetup = 4
Takes imperfection direction from global code setup. This value must not be used in code setup!
 MomentResultant = 2
resultant of moments
 Edit this page